Documents/КТ_НормыРасходаТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>КТ_НормыРасходаТМЦ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КТ_НормыРасходаТМЦ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСкважины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчастка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтчетПФА_ГруппировкаПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации_Удалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КТ_ВидыТМЦ_bug</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасхода_Удалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КТ_ВариантПланФакт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступЗакрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>киб_ВидБурения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.киб_ВидыБурения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНорм</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>30</v8:Digits>
									<v8:FractionDigits>20</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНДСПриИмпорте</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаАкциза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиАкциза</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКПВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентРасчетаОблагаемойБазыАкциза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПодакцизногоТМЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПодакцизныхТМЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСкважины</Name>
					<Comment>TS</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастокБурения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>си_ЯвляетсяСпецодеждойИнвентарем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>си_ОсновноеНазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.си_НазначенияИспользования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторТовараЭСФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодНацКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТМЦ</Name>
					<Comment>Вид ТМЦ для сводного отчета</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторВидовТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/КТ_НормыРасходаТМЦ/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Настройка формы при создании
	КТ_РаботаСФормамиСервер.ПриСозданииНаСервере(ЭтаФорма, Объект);
	// Конец 
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПодготовитьФормуНаСервере();
		
	КонецЕсли;
	
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
// Процедура - Подготовить форму на сервере
//
Процедура ПодготовитьФормуНаСервере()
	
	Если Параметры.Ключ.Пустая() Тогда
		
		КТ_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(Объект);
		
	КонецЕсли;
	
	ОбщегоНазначенияБК.УстановитьТекстАвтора(НадписьАвтор, Объект.Автор);
	
КонецПроцедуры

&НаСервере
// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодготовитьФормуНаСервере();
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура - При открытии
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	НастроитьДоступность();
	НастроитьВидимость();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
// Процедура - Настроить доступность
//
Процедура НастроитьДоступность()
	
	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Настроить видимость
//
Процедура НастроитьВидимость()
	
	
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
//Шапка документа
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	ОпределитьВидУчастка(Объект.Участок);
КонецПроцедуры

&НаСервере
Процедура ОпределитьВидУчастка(Участок)
	Объект.ВидУчастка = РегистрыСведений.ОтчетПФА_СоставГруппировокПодразделений.Получить(Новый Структура("Подразделение", Участок)).Группировка;
	Если Объект.ВидУчастка.Пустая() Тогда
		Объект.ВидУчастка = РегистрыСведений.ОтчетПФА_СоставГруппировокПодразделений.Получить(Новый Структура("Подразделение", Участок.Родитель)).Группировка;
	КонецЕсли;
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
//Табличные части документа
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
// Процедура - Заполнить по другому участку
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ЗаполнитьПоДругомуУчастку(Команда)
	
	ВыбранноеЗначение = ОткрытьФормуМодально("Документ.КТ_НормыРасходаТМЦ.ФормаВыбора", , ЭтаФорма);
	Если ВыбранноеЗначение <> Неопределено Тогда
		ЗаполнитьПоДругомуУчасткуНаСервере(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить по другому участку на сервере
//
Процедура ЗаполнитьПоДругомуУчасткуНаСервере(ДокументСсылка)
	
	Объект.СписокНорм.Загрузить(ДокументСсылка.СписокНорм.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
// Процедура - Заполнить номенклатуру по умолчанию
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ЗаполнитьНоменклатуруПоУмолчанию(Команда)
	
	Если Объект.СписокНорм.Количество() = 0 Тогда
		Сообщить("Документ не заполнен!");
		Возврат;
	КонецЕсли;
	
	Если Вопрос("Заполнить номенклатуру по умолчанию?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНоменклатуруПоУмолчаниюНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Заполнить номенклатуру по умолчанию на сервере
//
Процедура ЗаполнитьНоменклатуруПоУмолчаниюНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.НоменклатурнаяГруппа
	|ИЗ
	|	(ВЫБРАТЬ
	|		Номенклатура.Ссылка КАК Номенклатура,
	|		Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	|	ИЗ
	|		Справочник.Номенклатура КАК Номенклатура
	|	ГДЕ
	|		Номенклатура.НоменклатурнаяГруппа В(&СписокНомГрупп)
	|		И НЕ Номенклатура.ПометкаУдаления) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("СписокНомГрупп", Объект.СписокНорм.Выгрузить(, "НоменклатурнаяГруппа"));
	ТаблицаНоменклатурныхГрупп = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаСписокНорм Из Объект.СписокНорм Цикл
		НайденнаяСтрока = ТаблицаНоменклатурныхГрупп.Найти(СтрокаСписокНорм.НоменклатурнаяГруппа, "НоменклатурнаяГруппа");
		Если НайденнаяСтрока <>Неопределено Тогда
			СтрокаСписокНорм.Номенклатура = НайденнаяСтрока.Номенклатура; 	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Список норм номенклатура при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура СписокНормНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.СписокНорм.ТекущиеДанные;
	ДанныеСтроки = Новый Структура("Номенклатура,НоменклатурнаяГруппа");
	
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, ТекущиеДанные);
	СписокНормНоменклатураПриИзмененииНаСервере(ДанныеСтроки);
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСтроки);
	
КонецПроцедуры

&НаСервере
// Процедура - Список норм номенклатура при изменении на сервере
//
Процедура СписокНормНоменклатураПриИзмененииНаСервере(ДанныеСтроки)
	
	ДанныеСтроки.НоменклатурнаяГруппа = ДанныеСтроки.Номенклатура.НоменклатурнаяГруппа;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
//Подвал
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
// Процедура - Комментарий начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	#Если ТонкийКлиент Тогда
		КТ_РаботаСДиалогамиКлиент.ПоказатьФормуРедактированияКомментария(Объект.Комментарий, ЭтаФорма, "Комментарий");
	#КонецЕсли
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
//Основные действия формы при закрытии
////////////////////////////////////////////////////////////////////////////////

&НаКлиенте
// Процедура - Перед записью (используется при контроле по финплану)
//
// Параметры:
//  Отказ			 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	
	
КонецПроцедуры

&НаСервере
// Процедура - Перед записью на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
	
КонецПроцедуры

&НаКлиенте
// Процедура - Перед закрытием
//
// Параметры:
//  Отказ				 - 	 - 
//  ЗавершениеРаботы	 - 	 - 
//  ТекстПредупреждения	 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
// Процедура - При закрытии
//
// Параметры:
//  ЗавершениеРаботы - 	 - 
//
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	
	
КонецПроцедуры

&НаСервере
// Процедура - При записи на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
// Процедура - После записи
//
// Параметры:
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	
	
КонецПроцедуры

// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьЗаголовокФормыДокумента("", Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры
